Tekla Open API Reference for Tekla Structures 2025
PolycurveGeometryBuilder.AppendTangentSegment Method
 Appends a line segment of the given length tangent to the last curve of the list.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PolycurveGeometryBuilder AppendTangentSegment(
	double length
)
Public Function AppendTangentSegment (
	length As Double
) As PolycurveGeometryBuilder
Parameters
length
Type: System.Double
Length of the segment to append
Return Value
Type: PolycurveGeometryBuilder
The builder itself
Remarks
 This function requires that there is at least one curve in the polycurve
See Also
Reference
PolycurveGeometryBuilder Class
Tekla.Structures.Geometry3d Namespace